app/views/genres/show.html.erb

SELECT "songs".* FROM "songs" INNER JOIN "genres_songs" ON "songs"."id" = "genres_songs"."song_id" WHERE "genres_songs"."genre_id" = $1  [["genre_id", 1]]
---
<h1>songss</h1>
<% @genre.songs.each do |p| %>