app/views/songs/show.html.erb

<h1>Genres</h1>
<% @song.genres.each do |p| %>
---
SELECT "genres".* FROM "genres" INNER JOIN "genres_songs" ON "genres"."id" = "genres_songs"."genre_id" WHERE "genres_songs"."song_id" = $1  [["song_id", 1]]