part1/app/controllers/songs_controller.rb

	def index
		@songs = Song.where(:genre_id => params[:genre_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."genre_id" = $1 ORDER BY "songs"."id" ASC LIMIT $2  [["genre_id", 1], ["LIMIT", 1]]