app/controllers/categories_controller.rb

    def create
        @category = Category.new(params_category)
        @category.save
---
INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "beno"], ["description", "yummy"], ["created_at", "2018-07-20 01:32:26.743386"], ["updated_at", "2018-07-20 01:32:26.743386"]]

    def update
        @category = Category.find(params[:id])
        @category.update(params_category)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "categories" SET "description" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["description", "yummy food"], ["updated_at", "2018-07-20 01:33:07.690467"], ["id", 3]]