app/controllers/genres_controller.rb

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "genres".* FROM "genres"
---
  def index
    if params[:song_id]
      @song = Song.find(params[:song_id])
      @genres = @song.genres
    else
      @genre = Genre.all

SELECT "songs".* FROM "songs"
---
  def new
    @genre = Genre.new
    @songs = Song.all

INSERT INTO "genres" ("name") VALUES ($1) RETURNING "id"  [["name", "Childrens"]]
---
  def create
    @genre = Genre.new(genre_params)
    @genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @genre = Genre.find(params[:id])