app/controllers/items_controller.rb

    def create
        @item = Item.new(params_item)
        @item.save
---
INSERT INTO "items" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "beef don"], ["description", "Black pepper beef served with Japanese rice"], ["created_at", "2018-07-19 21:57:29.164536"], ["updated_at", "2018-07-19 21:57:29.164536"]]

    def update
        @item = Item.find(params[:id])
        @item.update(params_item)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "name" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["name", "super salmon don"], ["updated_at", "2018-07-19 21:40:01.741657"], ["id", 1]]