app/controllers/songs_controller.rb

SELECT "genres".* FROM "genres"
---
  def new
    @song = Song.new
    @genres = Genre.all

INSERT INTO "songs" ("name") VALUES ($1) RETURNING "id"  [["name", "old mcdonald"]]
---
  def create
    @song = Song.new(song_params)
    @song.save

SELECT "genres".* FROM "genres"
---
  def edit
    @genres = Genre.all

UPDATE "songs" SET "name" = $1 WHERE "songs"."id" = $2  [["name", "happy birthday - edited"], ["id", 1]]
---
  def update
    @song.update(song_params)

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def find_song
      @song = Song.find(params[:id])